#+STARTUP: showeverything
#+STARTUP: inlineimages
#+PROPERTY: header-args :tangle yes
# the above line causes all code blocks to be tangled unless you give it "tangle no" at the beginning

*** Other programming languages
Most of these are simple invocations of ~use-package~ and require no explanation.
#+begin_src emacs-lisp
  (use-package php-mode
    :ensure (:host github :repo "emacs-php/php-mode"))

  (use-package php-ts-mode
    :ensure (:host github :repo "emacs-php/php-ts-mode"))

  (use-package yaml-mode
    :mode "\\.yml\\'"
    :ensure (:host github :repo "yoshiki/yaml-mode"))

  (use-package web-mode)

  (use-package terraform-mode
    :ensure t)

  (use-package glsl-mode
    :ensure (:host github :repo "jimhourihan/glsl-mode"))

  (use-package python)
  (use-package lsp-python-ms
    :after (lsp-mode python)
    :init (setq lsp-python-ms-auto-install-server t))

  (use-package ein
    :ensure t
    :init
    (add-to-list 'auto-mode-alist '("\\.ipynb\\'" . ein:notebooklist-open))
    )
  
  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (use-package go-mode)

#+end_src

#+RESULTS:
: [nil 26632 37308 118800 nil elpaca-process-queues nil nil 0 nil]

Some generally-useful stuff like Dashboard and packages like Org for writing prose comes here.  If you read below and are confused, it's not a typo: ~pdflatex~ needs to be invoked three times because of the way the standard LaTeX recipe works, which goes something like this:

1. ~$ latex <filename>~
2. ~$ bibtex <filename>~
3. ~$ latex <filename>~
4. ~$ latex <filename>~


Basically, the first time you run it, latex writes citations and stuff like ~\label~ to a ~.aux~ file, which is what bibtex reads.  BibTeX reads that file as well as the ~.bib~ file and uses that to format the references.  When you run LaTeX a second time it also reads both ~.aux~ and ~.tex~ files and if bibtex generated any ~.bbl~ files it reads those as well, which is how it inserts the references into the output.  The third run is what causes the citations and labels to get inserted into the output.  If you have multiple bibliographies you'll need more invocations of bibtex and latex and it quickly becomes a clusterfuck.  Anyways this is why I have three calls to ~pdflatex~ in there.

#+begin_src emacs-lisp
  (use-package dashboard
    :config
    (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
    (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
    (add-hook 'window-size-change-functions #'dashboard-resize-on-hook 100)
    (add-hook 'window-setup-hook #'dashboard-resize-on-hook)
    (setq dashboard-items '((recents . 20) (bookmarks . 20)))
    (setq dashboard-banner-logo-title "Hacks and glory await!")
    (setq recentf-exclude '("bookmarks"))
    (setq dashboard-startup-banner (expand-file-name "~/.emacs.d/dashboard-logo.png" user-emacs-directory)))

  (use-package org
    :init
    (setf org-list-allow-alphabetical t)
    (setf org-src-tab-acts-natively t)
    (setf org-startup-truncated nil)
    :config
    (org-babel-do-load-languages 'org-babel-load-languages '((R . t)
                                                             (lisp . t)
                                                             (emacs-lisp . t)
                                                             (python . t)))
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block-begin-line nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block-end-line nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block-begin-line nil :slant 'normal :underline nil :extend nil)
    (set-face-attribute 'org-block-end-line nil :slant 'normal :overline nil :extend nil)
    (setf org-html-preamble nil)
    (setf org-html-postamble nil)
    (setq org-latex-listings 'minted)
    (setq org-latex-packages-alist '(("" "minted")))
    (setq org-latex-pdf-process
    '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
      "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
      "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f")))

  (use-package org-bullets
    :init
    (add-hook 'org-mode-hook (lambda ()
        		       (org-bullets-mode 1))))

  (use-package ox-rfc)

  (use-package tex
    :ensure (:host github :repo "emacs-straight/auctex"))

  (use-package markdown-mode
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "multimarkdown"))
#+end_src

For writing prose or anything non-code I like to use Olivetti which adds some nice gutters on either side of the screen and pair it with variable pitch fonts.

#+begin_src emacs-lisp
  (use-package olivetti
    :init
    (add-hook 'text-mode-hook (lambda ()
				(olivetti-mode 1)
				(olivetti-set-width 140)
				(variable-pitch-mode 1))))
#+end_src

